{
  "architectures": [
    "ProteoR1GenerateModel"
  ],
  "boltz_ckpt_path": null,
  "boltz_dtype": "float32",
  "boltz_hparams": {
    "alpha_pae": 0.0,
    "atom_feature_dim": 389,
    "atom_s": 128,
    "atom_z": 16,
    "atoms_per_window_keys": 128,
    "atoms_per_window_queries": 32,
    "compile_confidence": false,
    "compile_pairformer": false,
    "compile_structure": false,
    "confidence_imitate_trunk": false,
    "confidence_model_args": {
      "add_s_input_to_s": true,
      "add_s_to_z_prod": true,
      "add_z_input_to_z": true,
      "confidence_args": {
        "num_pae_bins": 64,
        "num_pde_bins": 64,
        "num_plddt_bins": 50
      },
      "max_dist": 22,
      "num_dist_bins": 64,
      "use_s_diffusion": false
    },
    "confidence_prediction": false,
    "diffusion_loss_args": {
      "add_smooth_lddt_loss": true,
      "ligand_loss_weight": 10.0,
      "nucleotide_loss_weight": 5.0
    },
    "diffusion_process_args": {
      "P_mean": -1.2,
      "P_std": 1.5,
      "alignment_reverse_diff": true,
      "coordinate_augmentation": true,
      "gamma_0": 0.8,
      "gamma_min": 1.0,
      "noise_align": true,
      "noise_scale": 1.0,
      "noise_type": "discrete_absorb",
      "rho": 7,
      "sigma_data": 16.0,
      "sigma_max": 160.0,
      "sigma_min": 0.0004,
      "step_scale": 1.0,
      "synchronize_sigmas": true,
      "use_inference_model_cache": true
    },
    "ema": true,
    "ema_decay": 0.999,
    "embedder_args": {
      "atom_encoder_depth": 3,
      "atom_encoder_heads": 4
    },
    "ligand_rmsd_weight": 10.0,
    "max_dist": 22.0,
    "min_dist": 2.0,
    "msa_args": {
      "activation_checkpointing": true,
      "msa_blocks": 4,
      "msa_dropout": 0.15,
      "msa_s": 64,
      "offload_to_cpu": false,
      "pairwise_head_width": 32,
      "pairwise_num_heads": 4,
      "z_dropout": 0.25
    },
    "no_atom_encoder": false,
    "no_msa": false,
    "nucleotide_rmsd_weight": 5.0,
    "num_bins": 64,
    "pairformer_args": {
      "activation_checkpointing": true,
      "dropout": 0.25,
      "num_blocks": 48,
      "num_heads": 16,
      "offload_to_cpu": false
    },
    "predict_args": null,
    "score_model_args": {
      "activation_checkpointing": true,
      "atom_decoder_depth": 3,
      "atom_decoder_heads": 4,
      "atom_encoder_depth": 3,
      "atom_encoder_heads": 4,
      "conditioning_transition_layers": 2,
      "dim_fourier": 256,
      "offload_to_cpu": false,
      "sequence_model_args": {
        "dropout": 0.1,
        "hidden_dim": 768,
        "vocab_size": 20
      },
      "sequence_train_type": "normal",
      "sigma_data": 16,
      "token_transformer_depth": 24,
      "token_transformer_heads": 16
    },
    "sequence_prediction_training": true,
    "structure_inpainting": false,
    "structure_prediction_training": true,
    "token_s": 384,
    "token_z": 128,
    "training_args": {
      "adam_beta_1": 0.9,
      "adam_beta_2": 0.95,
      "adam_eps": 1e-08,
      "base_lr": 0.0,
      "confidence_loss_weight": 0.0001,
      "diffusion_loss_weight": 4.0,
      "diffusion_multiplicity": 1,
      "diffusion_samples": 1,
      "distogram_loss_weight": 0.03,
      "lr_decay_every_n_steps": 100,
      "lr_decay_factor": 0.999,
      "lr_scheduler": "af3",
      "lr_start_decay_after_n_steps": 100,
      "lr_warmup_no_steps": 1,
      "max_lr": 0.0005,
      "recycling_steps": 3,
      "sampling_steps": 200
    },
    "validation_args": {
      "diffusion_samples": 1,
      "recycling_steps": 3,
      "run_confidence_sequentially": false,
      "sampling_steps": 200,
      "symmetry_correction": true
    }
  },
  "bos_token_id": 151643,
  "conditioning_c_s_inputs": 455,
  "conditioning_c_text": null,
  "conditioning_method": "add_embed",
  "conditioning_use_layernorm": true,
  "conditioning_use_learnable_scale": true,
  "conditioning_use_zero_init": true,
  "confidence_loss_weight": 0.0001,
  "confidence_scaler_params": {},
  "confidence_scaler_type": "identity",
  "diffusion_loss_weight": 4.0,
  "distogram_loss_weight": 0.03,
  "dtype": "float32",
  "ema": true,
  "ema_decay": 0.999,
  "eos_token_id": 151645,
  "hidden_size": 2560,
  "load_pretrained": false,
  "model_type": "proteor1_generate",
  "num_hidden_layers": 36,
  "override_training_args": {
    "adam_beta_1": 0.9,
    "adam_beta_2": 0.95,
    "adam_eps": 1e-08,
    "base_lr": 0.0,
    "diffusion_multiplicity": 1,
    "diffusion_samples": 1,
    "lr_decay_every_n_steps": 100,
    "lr_decay_factor": 0.999,
    "lr_start_decay_after_n_steps": 100,
    "lr_warmup_no_steps": 10,
    "max_lr": 0.0002,
    "recycling_steps": 3,
    "sampling_steps": 200
  },
  "override_validation_args": {
    "diffusion_samples": 1,
    "recycling_steps": 3,
    "run_confidence_sequentially": false,
    "sampling_steps": 200,
    "symmetry_correction": true
  },
  "skip_understanding_model_load": true,
  "training_mode": "generation_only",
  "transformers_version": "4.57.1",
  "understanding_dtype": "bfloat16",
  "understanding_model_id": "Qwen/Qwen3-4B-Instruct-2507",
  "vocab_size": 151936
}
